<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"7766c53bdbfe700f7d6e5bde0cfec7a00eccdc9612941023c47cd32758adb0fe","plan_job_ref":"Job Pull Request Checks #773 at https://github.com/GSA-TTS/FAC/actions/runs/6048388169","plan_hash":"568905601fd004e5ab3ec6fa7d73499103c25cedbb8e0392bc921e727ff2b20d","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.production.cloudfoundry_app.data_load will be created
  + resource "cloudfoundry_app" "data_load" {
      + buildpack                       = (known after apply)
      + disk_quota                      = 64
      + docker_image                    = "ghcr.io/gsa-tts/fac-historic-public-csvs/load-historic-public-data@sha256:8b6c2b1110e37de2bb0e4e38e3ab9b612118b0365d7f008c5ec8466aa149fea6"
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 64
      + name                            = "dataload"
      + ports                           = (known after apply)
      + space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 180
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #773](https://github.com/GSA-TTS/FAC/actions/runs/6048388169)